MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK60DN256ZVMD10/mcu.h
#define MPU                           0x00000004      // MPU Clock Gate Control
#define DMA                           0x00000002      // DMA Clock Gate Control
#define FLEXBUS                       0x00000001      // FlexBus Clock Gate Control


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_CLKDIV1 register.
//
//*****************************************************************************

#define OUTDIV1                       0x780000000      // Clock 1 output divider value
#define OUTDIV2                       0x78000000      // Clock 2 output divider value
#define OUTDIV3                       0x07800000      // Clock 3 output divider value
#define OUTDIV4                       0x00780000      // Clock 4 output divider value


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_CLKDIV2 register.
//
//*****************************************************************************

#define I2SDIV                        0x7FF80000000      // I2S clock divider value
#define I2SFRAC                       0x00780000      // I2S clock divider fraction
#define USBDIV                        0x00000038      // USB clock divider divisor
#define USBFRAC                       0x00000001      // USB clock divider fraction
#define USBDIV                        0x00000780      // USB clock divider divisor


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_FCFG1 register.
//
//*****************************************************************************

#define NVMSIZE                       0x780000000      // FlexNVM size
#define PFSIZE                        0x78000000      // Program flash size
#define EESIZE                        0x00780000      // EEPROM size
#define DEPART                        0x00007800      // FlexNVM partition


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_FCFG2 register.
//
//*****************************************************************************

#define SWAPPFLSH                     0x80000000      // Swap program flash
#define MAXADDR0                      0x7E0000000      // Max address block 0
#define PFLSH                         0x00800000      // Program flash
#define MAXADDR1                      0x07E00000      // Max address block 1
#define Reserved                      0x7FFF8000      // -


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_UIDH register.
//
//*****************************************************************************

#define UID                           0x7FFFFFFF80000000      // Unique Identification


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_UIDMH register.
//
//*****************************************************************************

#define UID                           0x7FFFFFFF80000000      // Unique Identification


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_UIDML register.
//
//*****************************************************************************

#define UID                           0x7FFFFFFF80000000      // Unique Identification


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_UIDL register.
//
//*****************************************************************************

#define UID                           0x7FFFFFFF80000000      // Unique Identification


//*****************************************************************************
//
// The following are defines for the bit fields in the MC_SRSH register.
//
//*****************************************************************************

#define SW                            0x00000004      // Indicates reset was caused by software setting of SYSRESETREQ bit in Application Interrupt and Reset Control Register in the ARM Core
#define LOCKUP                        0x00000002      // Indicates reset was caused by the ARM core indication of a LOCKUP event
#define JTAG                          0x00000001      // Indicates reset was caused by JTAG selection of certain IR codes (EZPORT, EXTEST, HIGHZ, and CLAMP)


//*****************************************************************************
//
// The following are defines for the bit fields in the MC_SRSL register.
//
//*****************************************************************************

#define POR                           0x00000080      // Indicates a reset was caused by the power-on detection logic
#define PIN                           0x00000040      // Indicates reset was caused by an active-low level on the external RESETpin
#define COP                           0x00000020      // Reset was caused by the COP watchdog timer timing out
#define LOC                           0x00000004      // Indicates reset was caused by a loss of external clock
#define LVD                           0x00000002      // If the LVDRE bit is set and the supply drops below the LVD trip voltage, an LVD reset occurs
#define WAKEUP                        0x00000001      // Reset was caused by an enabled LLWU module wakeup source while the device was in LLS or VLLS modes


//*****************************************************************************
//
// The following are defines for the bit fields in the MC_PMPROT register.
//
//*****************************************************************************

#define AVLP                          0x00000020      // Provided the appropriate control bits are set up in PMCTRL, this write-once bit allows the MCU to enter the very low power modes: VLPR, VLPW, and VLPS
#define ALLS                          0x00000010      // This write once bit allows the MCU to enter low leakage stop mode (LLS) provided the appropriate control bits are set up in PMCTRL
#define AVLLS3                        0x00000004      // This write once bit allows the MCU to enter very low leakage stop 3 mode (VLLS3) provided the appropriate control bits are set up in PMCTRL
#define AVLLS2                        0x00000002      // This write once bit allows the MCU to enter very low leakage stop 2 mode (VLLS2) provided the appropriate control bits are set up in PMCTRL
#define AVLLS1                        0x00000001      // This write once bit allows the MCU to enter very low leakage stop 1 mode (VLLS1) provided the appropriate control bits are set up in PMCTRL


//*****************************************************************************
//
// The following are defines for the bit fields in the PMC_LVDSC1 register.
//
//*****************************************************************************

