MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK60DN256ZVMD10/mcu.h
#define LVDF                          0x00000080      // Low-Voltage Detect Flag
#define LVDACK                        0x00000040      // Low-Voltage Detect Acknowledge
#define LVDIE                         0x00000020      // Low-Voltage Detect Interrupt Enable
#define LVDRE                         0x00000010      // Low-Voltage Detect Reset Enable
#define LVDV                          0x00000006      // Low-Voltage Detect Voltage Select


//*****************************************************************************
//
// The following are defines for the bit fields in the PMC_LVDSC2 register.
//
//*****************************************************************************

#define LVWF                          0x00000080      // Low-Voltage Warning Flag
#define LVWACK                        0x00000040      // Low-Voltage Warning Acknowledge
#define LVWIE                         0x00000020      // Low-Voltage Warning Interrupt Enable
#define LVWV                          0x00000006      // Low-Voltage Warning Voltage Select


//*****************************************************************************
//
// The following are defines for the bit fields in the PMC_REGSC register.
//
//*****************************************************************************

#define TRAMPO                        0x00000010      // For devices with FlexNVM: Traditional RAM Power Option
#define VLPRS                         0x00000008      // Very Low Power Run Status
#define REGONS                        0x00000004      // Regulator in Run Regulation Status


//*****************************************************************************
//
// The following are defines for the bit fields in the MCM_PLASC register.
//
//*****************************************************************************

#define ASC                           0x00007F80      // Each bit in the ASC field indicates if there is a corresponding connection to the crossbar switch's slave input port.


//*****************************************************************************
//
// The following are defines for the bit fields in the MCM_PLAMC register.
//
//*****************************************************************************

#define AMC                           0x00007F80      // Each bit in the AMC field indicates if there is a corresponding connection to the AXBS master input port.


//*****************************************************************************
//
// The following are defines for the bit fields in the MCM_SRAMAP register.
//
//*****************************************************************************

#define SRAMLWP                       0x40000000      // SRAM_L write protect
#define SRAMLAP                       0x60000000      // SRAM_L arbitration priority
#define SRAMUWP                       0x04000000      // SRAM_U write protect
#define SRAMUAP                       0x06000000      // SRAM_U arbitration priority


//*****************************************************************************
//
// The following are defines for the bit fields in the MCM_ISR register.
//
//*****************************************************************************

#define NMI                           0x00000004      // Non-maskable interrupt pending
#define IRQ                           0x00000002      // Normal interrupt pending


//*****************************************************************************
//
// The following are defines for the bit fields in the MCM_ETBCC register.
//
//*****************************************************************************

#define ITDIS                         0x00000020      // ITM-to-TPIU disable
#define ETDIS                         0x00000010      // ETM-to-TPIU disable
#define RLRQ                          0x00000008      // Reload request
#define RSPT                          0x0000000C      // Response type
#define CNTEN                         0x00000001      // Counter enable


//*****************************************************************************
//
// The following are defines for the bit fields in the MCM_ETBRL register.
//
//*****************************************************************************

#define RELOAD                        0x001FFC00      // Byte count reload value


//*****************************************************************************
//
// The following are defines for the bit fields in the MCM_ETBCNT register.
//
//*****************************************************************************

#define COUNTER                       0x001FFC00      // Byte count counter value ::


//*****************************************************************************
//
// The following are defines for the bit fields in the AXBS_PRSn register.
//
//*****************************************************************************

#define M7                            0x1C0000000      // Master 7 priority. Sets the arbitration priority for this port on the associated slave port.
#define M6                            0x1C000000      // Master 6 priority. Sets the arbitration priority for this port on the associated slave port.
#define M5                            0x01C00000      // Master 5 priority. Sets the arbitration priority for this port on the associated slave port.
#define M4                            0x001C0000      // Master 4 priority. Sets the arbitration priority for this port on the associated slave port.
#define M3                            0x0001C000      // Master 3 priority. Sets the arbitration priority for this port on the associated slave port.
#define M2                            0x00001C00      // Master 2 priority. Sets the arbitration priority for this port on the associated slave port.
#define M1                            0x000001C0      // Master 1 priority. Sets the arbitration priority for this port on the associated slave port.
#define M0                            0x0000001C      // Master 0 priority. Sets the arbitration priority for this port on the associated slave port.


//*****************************************************************************
//
// The following are defines for the bit fields in the AXBS_CRSn register.
//
//*****************************************************************************

